[
    {
      "img": "../img/coding 1.webp",
      "alt": "coding",
      "label": "Artikel",
      "title": "Kenapa Belajar Coding Itu Gak Sesulit yang Kamu Kira",
      "content": "Belajar coding sering kali dianggap menakutkan, padahal sebenarnya gak serumit itu, lho! Di artikel ini, kita bakal bahas kenapa coding bisa jadi lebih mudah dan menyenangkan, terutama kalau kamu belajar dengan cara yang tepat. Yuk, intip tips dan trik buat kamu yang mau mulai belajar coding tanpa rasa takut!"
    },
    {
      "img": "../img/framework.webp",
      "alt": "framework",
      "label": "Artikel",
      "title": "Rahasia Sukses Membangun Website yang Bikin Pengunjung Betah",
      "content": "Membangun website itu bukan cuma soal tampilan yang keren. Ada banyak faktor lain yang bikin pengunjung betah dan terus balik lagi. Dari kecepatan loading, navigasi yang gampang, sampai konten yang relevan, semua kita bahas di sini. Buat kamu yang mau jadi web developer, artikel ini wajib banget dibaca!"
    },
    {
      "img": "../img/game.webp",
      "alt": "coding",
      "label": "Artikel",
      "title": "Kenapa Game Development Bisa Jadi Karir Impianmu",
      "content": "Kamu suka main game? Gimana kalau hobi kamu yang satu ini bisa jadi karir? Di artikel ini, kita akan ngobrolin tentang peluang karir di dunia game development. Mulai dari ide dasar sampai peluncuran game ke pasar, ternyata bikin game itu seru banget dan bisa jadi jalan karir yang menjanjikan!"
    },
    {
      "img": "../img/AI.webp",
      "alt": "coding",
      "label": "Artikel",
      "title": "Apa Itu AI dan Kenapa AI Penting Buat Masa Depan Kita?",
      "content": "AI alias kecerdasan buatan lagi naik daun banget nih! Tapi, apa sih sebenarnya AI itu? Dan kenapa AI penting banget buat masa depan kita? Artikel ini akan mengupas tuntas tentang AI dengan bahasa yang mudah dimengerti, plus contoh-contoh keren gimana AI sudah mulai mempengaruhi kehidupan kita sehari-hari."
    },
    {
      "img": "../img/cyber.webp",
      "alt": "coding",
      "label": "Artikel",
      "title": "5 Langkah Gampang Buat Lindungi Data Pribadi Kamu di Internet",
      "content": "Saat ini, menjaga keamanan data pribadi itu penting banget. Tapi, gimana caranya? Tenang, gak perlu panik! Di artikel ini, kamu bakal dapet 5 langkah simpel buat melindungi data pribadi kamu dari ancaman di dunia maya. Yuk, baca dan amankan datamu sekarang juga!"
    },
    {
      "img": "../img/AI.webp",
      "alt": "berita teknologi",
      "label": "Berita",
      "title": "Teknologi Blockchain: Masa Depan atau Hanya Hype?",
      "content": "Blockchain sering kali disebut-sebut sebagai teknologi masa depan. Namun, apakah teknologi ini benar-benar akan mengubah dunia seperti yang diprediksi, atau hanya sebuah hype? Artikel ini mengeksplorasi potensi dan tantangan dari teknologi blockchain."
    },
    {
      "img": "../img/framework.webp",
      "alt": "berita teknologi",
      "label": "Berita",
      "title": "5G dan Masa Depan Internet Kecepatan Tinggi",
      "content": "Dengan kehadiran teknologi 5G, internet kecepatan tinggi menjadi semakin nyata. Namun, apa sebenarnya 5G itu dan bagaimana pengaruhnya terhadap kehidupan kita sehari-hari? Temukan jawabannya di artikel ini."
    },
    {
      "img": "../img/cyber.webp",
      "alt": "berita teknologi",
      "label": "Berita",
      "title": "Keamanan Siber: Tantangan Besar di Era Digital",
      "content": "Seiring dengan semakin berkembangnya teknologi digital, ancaman terhadap keamanan siber pun semakin meningkat. Artikel ini membahas tantangan-tantangan besar dalam menjaga keamanan siber di era digital."
    },
    {
      "img": "../img/game.webp",
      "alt": "berita teknologi",
      "label": "Berita",
      "title": "Augmented Reality: Memperluas Batasan Dunia Nyata",
      "content": "Augmented Reality (AR) sedang menjadi tren di berbagai sektor. Dari game hingga pendidikan, AR mulai mengubah cara kita berinteraksi dengan dunia di sekitar kita. Pelajari lebih lanjut tentang potensi AR di artikel ini."
    },
    {
      "img": "../img/coding 1.webp",
      "alt": "berita teknologi",
      "label": "Berita",
      "title": "Cloud Computing: Apa yang Harus Anda Ketahui",
      "content": "Cloud computing telah mengubah cara bisnis dan individu menyimpan serta mengelola data. Namun, apa itu cloud computing dan bagaimana cara kerjanya? Artikel ini akan memberikan pemahaman dasar tentang cloud computing dan manfaatnya."
    }
]
